In [10]:
import pandas as pd
import numpy as np

In [8]:
lst = [1, 2, 3, 4, 5]
pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [37]:
arr= np.array([1,2,3,4,5])
arr 
arr = pd.Series(arr)

In [16]:
pd.Series(data=['Eshant','mayur','Kirti','sakshi'], index = [1,2,3,4])

1    Eshant
2     mayur
3     Kirti
4    sakshi
dtype: object

In [19]:
steps = {'day1': 4000, 'day2' : 200, 'day3' : 3000}
pd.Series(steps)

day1    4000
day2     200
day3    3000
dtype: int64

In [22]:
pd.Series(5).repeat(3).reset_index(drop = True)

0    5
1    5
2    5
dtype: int64

In [24]:
s= pd.Series([10,20]).repeat([5,2]).reset_index(drop = True)
s

0    10
1    10
2    10
3    10
4    10
5    20
6    20
dtype: int64

In [26]:
s[4]

10

In [31]:
s[2:-2]

2    10
3    10
4    10
dtype: int64

In [41]:
arr.agg([min,max,sum]) #aggregation

min     1
max     5
sum    15
dtype: int64

In [50]:
sr = pd.Series([1,-2,3,4,-5],index = ([1,2,3,4,5]))
sr

1    1
2   -2
3    3
4    4
5   -5
dtype: int64

In [59]:
sr1 = pd.Series([1,-2,3,4,-5],index = ([1,2,3,4,5]))
arr
sr1.append(arr).reset_index(drop = True)

C:\Users\OM\AppData\Local\Temp\ipykernel_14828\4071571354.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  sr1.append(arr).reset_index(drop = True)

0    1
1   -2
2    3
3    4
4   -5
5    1
6    2
7    3
8    4
9    5
dtype: int64

In [64]:
type(sr1[1])

numpy.int64

In [66]:
sr1.astype('float')

1    1.0
2   -2.0
3    3.0
4    4.0
5   -5.0
dtype: float64

In [69]:
sr1 = pd.Series([1,2,34,10,50,2,50,6])
sr1

0     1
1     2
2    34
3    10
4    50
5     2
6    50
7     6
dtype: int64

In [71]:
sr1.between(10,30)

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
dtype: bool

In [78]:
ser = pd.Series(['Eshant das ', 'Data Science', 'Geeks for Geeks','Hello World'])

In [80]:
print(ser.str.upper())
print('-'*40)
print(ser.str.lower())

0        ESHANT DAS
1       DATA SCIENCE
2    GEEKS FOR GEEKS
3        HELLO WORLD
dtype: object
----------------------------------------
0        eshant das
1       data science
2    geeks for geeks
3        hello world
dtype: object

In [85]:
ser = pd.Series(['Eshant das ', 'Data Science', 'Geeks for Geeks','Hello World'])

for i in ser:
    print(i, len(i))

Eshant das  11
Data Science 12
Geeks for Geeks 15
Hello World 11

In [90]:
ser = pd.Series(['        Eshant das ', 'Data Science', 'Geeks for Geeks','Hello World'])

In [95]:
ser = ser.str.strip()
for i in ser: 
    print(i)

Eshant das
Data Science
Geeks for Geeks
Hello World

In [96]:
ser.str.split()

0          [Eshant, das]
1        [Data, Science]
2    [Geeks, for, Geeks]
3         [Hello, World]
dtype: object

In [103]:
ser.str.strip()

0         Eshant das
1       Data Science
2    Geeks for Geeks
3        Hello World
dtype: object

In [106]:
ser = pd.Series(['Eshant das ', 'Data@ Science', 'Geeks for Geeks','Hello @World'])
ser.str.contains('@')

0    False
1     True
2    False
3     True
dtype: bool

In [108]:
ser.str.replace('@','')

0        Eshant das
1       Data Science
2    Geeks for Geeks
3        Hello World
dtype: object

In [116]:
ser.str.endswith('G')

0    False
1    False
2    False
3    False
dtype: bool

In [122]:
ser.str.find('a')

0    3
1    1
2   -1
3   -1
dtype: int64

In [124]:
ser.to_list()

['Eshant das ', 'Data@ Science', 'Geeks for Geeks', 'Hello @World']

In [128]:
lst = ['geeks','for','geeks','hello','world']
pd.DataFrame(lst)

       0
0  geeks
1    for
2  geeks
3  hello
4  world

In [148]:
data = { 'Name'         :['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age'          :[27, 24, 22, 32],
         'Address'      :['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

df = pd.DataFrame(data)
df1 = df[['Name','Qualification']]
print(df)
print("-"*50)
print(df1)

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd
--------------------------------------------------
     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [158]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}

df= pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [171]:
df.loc[1:2,'two':'three']

   two  three
1   20    200
2   30    300

In [177]:
print(df)
print('-'*50)
print(df.T)

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
--------------------------------------------------
          0     1     2     3
one       1     2     3     4
two      10    20    30    40
three   100   200   300   400
four   1000  2000  3000  4000

In [188]:
df.loc[df['two']>20,['three','four']]

   three  four
2    300  3000
3    400  4000

In [189]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [192]:
df['five']=[11,22,33,44]
df

   one  two  three  four  five
0    1   10    100  1000    11
1    2   20    200  2000    22
2    3   30    300  3000    33
3    4   40    400  4000    44

In [203]:
df['six'] = df['three']+df['two']
df

   one  two  three  four  five  six
0    1   10    100  1000    11  110
1    2   20    200  2000    22  220
2    3   30    300  3000    33  330
3    4   40    400  4000    44  440

In [204]:
df.pop('six')
df

   one  two  three  four  five
0    1   10    100  1000    11
1    2   20    200  2000    22
2    3   30    300  3000    33
3    4   40    400  4000    44

In [213]:
print(df.axes)
print('-'*50)
print(df.ndim)
print('-'*50)
print(df.dtypes)
print('-'*50)
print(df.shape)
print('-'*50)
print(df.head())

[RangeIndex(start=0, stop=4, step=1), Index(['one', 'two', 'three', 'four', 'five'], dtype='object')]
--------------------------------------------------
2
--------------------------------------------------
one      int64
two      int64
three    int64
four     int64
five     int64
dtype: object
--------------------------------------------------
(4, 5)
--------------------------------------------------
   one  two  three  four  five
0    1   10    100  1000    11
1    2   20    200  2000    22
2    3   30    300  3000    33
3    4   40    400  4000    44

In [220]:
d = { 'Name'  :pd.Series(['Tom','Jerry','Spike','Popeye','Olive','Bluto','Mickey']),
      'Age'   :pd.Series([10,12,14,30,28,33,15]),
      'Height':pd.Series([3.25,1.11,4.12,5.47,6.15,6.67,2.61])}

d1= pd.DataFrame(d)
d1.head(3)

    Name  Age  Height
0    Tom   10    3.25
1  Jerry   12    1.11
2  Spike   14    4.12

In [223]:
d1.tail(2)

     Name  Age  Height
5   Bluto   33    6.67
6  Mickey   15    2.61

In [252]:
print(df)
print('-'*25,'sum','-'*25)
print(df.sum())
print('-'*25,'mean','-'*25)
print(df.mean())
print('-'*25,'median','-'*25)
print(df.median())
print('-'*25,'var','-'*25)
print(df.var())
print('-'*25,'min','-'*25)
print(df.min())
print('-'*25,'max','-'*25)
print(df.max())
print('-'*25,'Stanard Deviation','-'*25)
print(df.std())

   one  two  three  four  five
0    1   10    100  1000    11
1    2   20    200  2000    22
2    3   30    300  3000    33
3    4   40    400  4000    44
------------------------- sum -------------------------
one         10
two        100
three     1000
four     10000
five       110
dtype: int64
------------------------- mean -------------------------
one         2.5
two        25.0
three     250.0
four     2500.0
five       27.5
dtype: float64
------------------------- median -------------------------
one         2.5
two        25.0
three     250.0
four     2500.0
five       27.5
dtype: float64
------------------------- var -------------------------
one      1.666667e+00
two      1.666667e+02
three    1.666667e+04
four     1.666667e+06
five     2.016667e+02
dtype: float64
------------------------- min -------------------------
one         1
two        10
three     100
four     1000
five       11
dtype: int64
------------------------- max -------------------------
one         4
two        40
three     400
four     4000
five       44
dtype: int64
------------------------- Stanard Deviation -------------------------
one         1.290994
two        12.909944
three     129.099445
four     1290.994449
five       14.200939
dtype: float64

In [246]:

print('-'*25,'Mode','-'*25)
de = pd.DataFrame({'A': [1, 2, 2, 3, 4, 4, 4, 5], 'B': [10, 20, 20, 30, 40, 40, 50, 60]})

print('A',de['A'].mode())
print('B',de['B'].mode())

------------------------- Mode -------------------------
A 0    4
Name: A, dtype: int64
B 0    20
1    40
Name: B, dtype: int64

In [253]:
df.describe()

            one        two       three         four       five
count  4.000000   4.000000    4.000000     4.000000   4.000000
mean   2.500000  25.000000  250.000000  2500.000000  27.500000
std    1.290994  12.909944  129.099445  1290.994449  14.200939
min    1.000000  10.000000  100.000000  1000.000000  11.000000
25%    1.750000  17.500000  175.000000  1750.000000  19.250000
50%    2.500000  25.000000  250.000000  2500.000000  27.500000
75%    3.250000  32.500000  325.000000  3250.000000  35.750000
max    4.000000  40.000000  400.000000  4000.000000  44.000000

In [271]:
six=df.apply(lambda x: x.max() - x.min())